export default {
    start: "Привет!\nЯ помогу тебе подготовиться к предстоящему собеседованию!\nПриступим?",
    refuse: `Тогда, я надеюсь, ты сам(а) справишься. Желаю успехов!\nЕсли что, я всегда готов помочь.\n`,
    notUnderstood: `Прости, я тебя не понимаю`,
    notFound: "Похоже, что ты завершил(а) со мной общение, введи /start!",
    pause: `Тогда прочитай мои советы выше и выполни рекомендации. Все получится! \nЕсли готов(а) идти дальше – подтверди это.`,
    restart: `Обучение сброшено, можешь пройти его раз! Введи /start`,
    requestRestart: `Похоже, что ты уже проходишь обучение. Напиши /restart чтобы начать заново!`,
    fuck: `Извините, на собеседовании не приветствуется такая лексика. Выражайтесь иначе.`,
    stages: {
        0: `Для начала попробуй ответить в своей голове на вопросы:\n✓	Знаю ли я, что от меня будут требовать на выбранной должности?\n✓	Знаком ли я с компанией, в которую собираюсь устраиваться на работу?\nЕсли вопросы тебя озадачили – тогда, в первую очередь, начни с изучения своей должности. Почитай информацию о компании, попробуй найти что-то новое, что тебя заинтересует.\nПойдем дальше?`,
        1: `Отлично!\nПервым и важным этапом в подготовке является проверка твоих профессиональных навыков. Если твоя будущая работа связана с техническими и профессиональными вопросами – подготовь ответы на них, повтори теорию и обязательно сделай тестовые задания. Ок?`,
        2: `Если для твоей будущей работы не нужны специальные знания – то первым делом подробно изучи вакансию и предположи, что может заинтересовать работодателя. Обязательно отметь для себя моменты, которые вызывают у тебя вопросы, чтобы задать их на собеседовании.\nТы разобрался(лась) в вакансии и знаешь, куда ты идешь?`,
        3: `Ты уже на шаг ближе к будущей работе!\nВнизу ты видишь список вопросов, которые, по моей статистике чаще всего встречаются на собеседовании и могут встретиться тебе. Можешь на них ответить. Это будет хорошей тренировкой!\n\n✓	Какой Вы человек? Расскажите о себе.\n✓	Что Вы считаете своим достижением? Назовите Ваши профессиональные достижения?\n✓	Назовите Ваши сильные и слабые стороны характера?\n✓	Какие Ваши качества помогут Вам в работе?\n✓	Вы конфликтный человек? \n✓	Вы коммуникабельны? Вы легко находите общий язык с людьми? Какую позицию Вы занимаете в коллективе? \n✓	Что вызывает у Вас трудности в работе?\n✓	Что Вы ждете от новой работы?\nДальше я могу дать тебе несколько советов в ответах. Хорошо?`,
        4: `Вот несколько советов, которые могут помочь в ответе на вопросы работодателя:\n✓ Отвечать нужно искренне и смело. Уверенность привлекает людей, а честность располагает к себе.\n✓ Работоспособность, трудолюбие и ответственность - это те качества, которые привлекут работодателей, ведь их цель - выбрать хорошего работника.\n✓ Не стоит говорить работодателю о том, что прошлая работа была негативной, с плохим начальником или ужасным коллективом. Если это было так, то правильнее сказать о своих ощущениях и об опыте, который удалось извлечь из прошлой работы.\n✓ Не нужно быть сухим и скучным. Лучше отвечать на вопросы открыто, а не просто «да» и «нет». Еще можно улыбаться и даже уместно пошутить.\nНадеюсь, советы помогут! Пойдем дальше?`,
        5: `Обрати внимания на следующие вопросы, которые могут вызвать сложность:\n✓	Где Вы видите себя через n лет?\n✓	Расскажите о Вашем опыте работы? Почему Вы ушли или Вас уволили с предыдущей работы?\n✓	Вспомните о Вашем провале, о какой-то ошибке на работе.\n✓	Что Вы купите на первую зарплату? Для чего хотите заработать денег?\n\nТеперь перейдем к последнему этапу подготовки! Хорошо?`,
        6: `Теперь ты лучше знаешь правила собеседования и понимаешь, что может тебя ожидать.\n✓	Запомни – главное быть собой. А для этого лучше не волноваться. Чтобы не волноваться, попробуй встать перед зеркалом и потренировать свою речь, и ты поймешь, что это не страшно!\n✓	Обязательно выспись перед собеседованием и продумай свой внешний вид в соответствии с требованиями и местом проведения интервью.\nВерю в тебя. Успехов!`,
        7: `Ты закончил обучение. Переходи к тренировке.\nЕсли хочешь пройти обучение еще раз введи /restart!`
    }

}
